# Lab-Data-Manipulation - Group By and Joins

In [1]:
import pandas as pd

In [2]:
# setup from last exercise

# # Load the dataset into a Pandas DataFrame
ufo = pd.read_csv('data/ufo.csv', sep=';')

# Remove the first column, since it is just for indexing the rows
ufo = ufo.drop('Unnamed: 0', axis=1)

# Create a subset of the dataset with the desired columns
ufo_vars = ufo.loc[:, ['year', 'month', 'state', 'country', 'ufo_shape', 'encounter_length']].rename(columns={'encounter_length': 'encounter_seconds'})

# Filter the dataset 'ufo_vars'
ufo_us = ufo_vars.loc[ufo_vars['country'] == 'us', :]

The second part of this lab consists of grouping and merging results to obtain valuable information.

# Grouping up the results.

## Let's calculate the average of the encounter for each country.

We should now group the results by the country column to see what is the mean encounter_seconds for each country. Do this using the `groupby` method of your dataframe `ufo_vars`. What is the average of the encounter for the us? And for Canada?

Remember that after grouping by a column, you have to specify a `aggregating function`. If you don't do that, the results of the groupby will only be a `groupby` pandas object. For this case, we want the aggregating function to be the `mean` function and then the results will appear for us.

Also remember that **if you don't** specify the `as_index=False` argument, the variables you use to group are going to become your new indexes.

Expected output:

>
>|    | country   |    year |   month |   encounter_seconds |
|---:|:----------|--------:|--------:|--------------------:|
|  0 | au        | 2002.69 | 6.12825 |             3806.47 |
|  1 | ca        | 2003.69 | 6.86167 |            28859.43 |
|  2 | de        | 2001.54 | 6.24762 |            24255.98 |
|  3 | gb        | 2003.65 | 6.5622  |            66061.32 |
|  4 | us        | 2004.09 | 6.8616  |             5800.19 |

In [3]:
# Group by country and find the average
ufo_vars.groupby(by='country', as_index=False).mean().style.format({'year': '{:.2f}', 'month': '{:.4f}', 'encounter_seconds': '{:.2f}'})

In [4]:
# Print answers on the screen
print('The average encounter for the US is 5,800.19, while for Canada is 28,859.43.')

The average encounter for the US is 5,800.19, while for Canada is 28,859.43.

## Perform the same task, but instead of calculating the mean, count how many occurrances for each country.

For this case, the aggregating function should be the `count` function. Try to understand the results for each column.

Expected output:

>
>|    | country   |   year |   month |   state |   ufo_shape |   encounter_seconds |
|---:|:----------|-------:|--------:|--------:|------------:|--------------------:|
|  0 | au        |    538 |     538 |      10 |         527 |                 538 |
|  1 | ca        |   3000 |    3000 |    2985 |        2955 |                3000 |
|  2 | de        |    105 |     105 |       0 |         103 |                 105 |
|  3 | gb        |   1905 |    1905 |      12 |        1855 |                1905 |
|  4 | us        |  65114 |   65114 |   65114 |       63561 |               65112 |

In [5]:
# Group by country and find the number of occurances
ufo_vars.groupby(by='country', as_index=False).count()

  country   year  month  state  ufo_shape  encounter_seconds
0      au    538    538     10        527                538
1      ca   3000   3000   2985       2955               3000
2      de    105    105      0        103                105
3      gb   1905   1905     12       1855               1905
4      us  65114  65114  65114      63561              65112

## Perform the same task, but instead of calculating the mean, use the `.describe()` aggregating function to see the effects.

The describe aggregating function will show you several important statistics for the grouped results, such as `mean`, `median`, `standard deviation`, `count`, `max`, `min`, and so on.

*Hint: If it starts to get difficult to see the results, you can tranpose the resulting dataframe by just putting a `.T` at the end.*

Expected output:

>
>|                   |   count |       mean |          std |      min |   25% |   50% |   75% |           max |
|:------------------|--------:|-----------:|-------------:|---------:|------:|------:|------:|--------------:|
| year              |   80332 | 2003.85    |     10.4268  | 1906     |  2001 |  2006 |  2011 | 2014          |
| month             |   80332 |    6.83491 |      3.23486 |    1     |     4 |     7 |     9 |   12          |
| encounter_seconds |   80329 | 9017.23    | 620228       |    0.001 |    30 |   180 |   600 |    97836000   |

In [6]:
# Check the statiscal summary of the dataset
ufo_vars.describe().T

,count,mean,std,min,25%,50%,75%,max
year,80332.0,2003.850085,10.426832,1906.000,2001.0,2006.0,2011.0,2014.0
month,80332.0,6.834910,3.234863,1.000,4.0,7.0,9.0,12.0
encounter_seconds,80329.0,9017.225634,620228.369318,0.001,30.0,180.0,600.0,97836000.0

## Now, let's get deeper in the analysis and group the results not only by country. But by `country` and `year`

### Check the values of the mean and count for the `encounter_seconds` variable for each year. Can you see some discrepancy?

*Hint*: If you want, you can use the `ufo_us` dataset just to see the results for the united states. You could also (in a hacky way) perform the filter right before the groupby operation if you wanted.

In [7]:
# Group by 'country' and 'year' of all the dataset and find the mean for 'encounter_seconds'
ufo_vars.groupby(by=['country', 'year'])[['encounter_seconds']].mean().T  # This is a dataframe

country                au                                                  \
year                 1958   1960   1967   1968        1972    1974   1975
encounter_seconds  2700.0  180.0  300.0  300.0  403.333333  1845.0  706.0

country                               ...           us               \
year                1976  1977  1978  ...         2005         2006
encounter_seconds  101.0  30.0  82.5  ...  1126.444772  1156.480149

country                                                                \
year                      2007         2008         2009         2010
encounter_seconds  2539.177378  4336.709833  3229.618521  2271.987232

country
year                      2011          2012         2013        2014
encounter_seconds  2544.292555  10640.644916  1266.387888  782.372979

[1 rows x 282 columns]

In [8]:
# Group by 'country' and 'year' of all the dataset and find the number for 'encounter_seconds'
ufo_vars.groupby(by=['country', 'year'])[['encounter_seconds']].count().T  # This is a dataframe

country             au                                               ...  \
year              1958 1960 1967 1968 1972 1974 1975 1976 1977 1978  ...
encounter_seconds    1    1    1    1    3    2    4    3    1    2  ...

country              us
year               2005  2006  2007  2008  2009  2010  2011  2012  2013  2014
encounter_seconds  3227  2884  3470  4017  3677  3548  4379  6320  6056  1964

[1 rows x 282 columns]

In [9]:
# Group by 'year' of the dataset only for the US and find the mean for 'encounter_seconds' and store its statistical
# summary in a variable
ufo_us_mean_summary = ufo_us.groupby(by='year')[['encounter_seconds']].mean().describe().T.to_dict()

# Print the answer on the screen
print(f'The discrepancy of the mean of "encounter_seconds" throughtout the years can be verified checking the standad',
      f'deviation, which is {ufo_us_mean_summary["std"]["encounter_seconds"]:.2f}, a extremely high value.', sep=' ')
ufo_us.groupby(by='year')[['encounter_seconds']].mean().describe().T

The discrepancy of the mean of "encounter_seconds" throughtout the years can be verified checking the standad deviation, which is 43268.25, a extremely high value.

,count,mean,std,min,25%,50%,75%,max
encounter_seconds,83.0,12185.564977,43268.254528,5.0,810.104015,1290.0,3959.6387,372312.563889

In [10]:
# Group by 'year' of the dataset only for the US and find the count for 'encounter_seconds' and store its statistical
# summary in a variable
ufo_us_count_summary = ufo_us.groupby(by='year')[['encounter_seconds']].count().describe().T.to_dict()

# Print the answer on the screen
print(f'Similar to what happened to the mean, there is a huge discrenpacy of the count of "encounter_seconds" along the',
      f'years. The standard deviation for the count is {ufo_us_count_summary["std"]["encounter_seconds"]:.2f}, a extremly',
      f'high value.', sep=' ')
ufo_us.groupby(by='year')[['encounter_seconds']].count().describe().T

Similar to what happened to the mean, there is a huge discrenpacy of the count of "encounter_seconds" along the years. The standard deviation for the count is 1431.05, a extremly high value.

,count,mean,std,min,25%,50%,75%,max
encounter_seconds,83.0,784.481928,1431.048058,1.0,29.5,147.0,291.0,6320.0

# BONUS 2: Which months are the ones with the highest numbers of occurrences?

**Example of output:**

>
>|   month |   occurrences |
|--------:|--------------:|
|       7 |          9520 |
|       8 |          8636 |
|       6 |          8152 |
|       9 |          7589 |
|      10 |          7407 |
|      11 |          6739 |
|       1 |          5689 |
|      12 |          5665 |
|       4 |          5527 |
|       3 |          5450 |
|       5 |          5293 |
|       2 |          4665 |

In [11]:
# Group by 'month' and count the number of occurances using the column 'year'
# Then sort the result in a desceding way and rename the column 'year' to 'occurance'
ufo_vars.groupby(by='month')[['year']].count().sort_values(by=['year'], ascending=False).rename(columns={'year': 'occurances'})

       occurances
month
7            9520
8            8636
6            8152
9            7589
10           7407
11           6739
1            5689
12           5665
4            5527
3            5450
5            5293
2            4665

# BONUS 3: Finally, you gathered information about the UFO dataset. Using your last result, try to bring that information for your original dataset.

1. Store the results of your previous analysis (the mean value for the encounter_seconds for each year and each country) in a dataframe called `avg_results`. 

Expected output:
>
>|     | country   |   year |   encounter_seconds |
|----:|:----------|-------:|--------------------:|
|   0 | au        |   1958 |      2700           |
|   1 | au        |   1960 |       180           |
|   2 | au        |   1967 |       300           |
|   3 | au        |   1968 |       300           |
|   4 | au        |   1972 |       403.333       | 
|   ... | ...        |   ... |       ...       | 
| 277 | us        |   2010 |      2271.99        |
| 278 | us        |   2011 |      2544.29        |
| 279 | us        |   2012 |     10640.6         |
| 280 | us        |   2013 |      1266.39        |
| 281 | us        |   2014 |       782.373       |

2. Rename the column named `encounter_seconds` to `avg_encounter_seconds`.

Expected output:
>
>|     | country   |   year |   avg_encounter_seconds |
|----:|:----------|-------:|--------------------:|
|   0 | au        |   1958 |      2700           |
|   1 | au        |   1960 |       180           |
|   2 | au        |   1967 |       300           |
|   3 | au        |   1968 |       300           |
|   4 | au        |   1972 |       403.333       | 
|   ... | ...        |   ... |       ...       | 
| 277 | us        |   2010 |      2271.99        |
| 278 | us        |   2011 |      2544.29        |
| 279 | us        |   2012 |     10640.6         |
| 280 | us        |   2013 |      1266.39        |
| 281 | us        |   2014 |       782.373       |

3. Use the pd.merge( ... ) function to bring that new collected information to your original dataset.
The pd.merge() function requires several arguments, let's understand the most important ones.

`left` is the dataframe you want to bring information **to** - the table on the left. 

`right` is the dataframe you want to bring information **from** - the table on the right. 

`on` is the key you want to perform the merge. That is, if those values are **exactly equal** in both dataframes, then the information will be brought.

Put your results on a dataframe called `merged_ufo`

Check how many rows the final result has and try to explain it. Did the dataset get smaller? Bigger? Or the same? Can you explain why? 

*hint: If you've found something weird, try looking back at your original dataframe and find something interesting on it.*

## Store the results into a new csv file called `ufo_enriched.csv`. 

Don't forget to use `index=False`.